<a href="https://colab.research.google.com/github/JakeOh/202011_itw_bd21/blob/main/lab_da/da15_reshape.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

# DataFrame 모양(shape) 변경

*   wide (column) -> long (row)
*   long (row) -> wide (column)

## stack/unstack

In [2]:
df = pd.DataFrame(data=np.arange(1, 7).reshape((2, 3)),
                  columns=['a', 'b', 'c'],
                  index=['A', 'B'])
df

   a  b  c
A  1  2  3
B  4  5  6

In [3]:
df_stacked = df.stack()
df_stacked

A  a    1
   b    2
   c    3
B  a    4
   b    5
   c    6
dtype: int64

In [4]:
df_unstacked = df_stacked.unstack()
df_unstacked

   a  b  c
A  1  2  3
B  4  5  6

In [5]:
df_unstacked2 = df_stacked.unstack(level=0)
df_unstacked2

   A  B
a  1  4
b  2  5
c  3  6

In [6]:
df = pd.DataFrame(data=np.arange(1, 13).reshape((2, 6)),
                  columns=[['A'] * 3 + ['B'] * 3,
                           ['a', 'b', 'c'] * 2])
df

   A         B
   a  b  c   a   b   c
0  1  2  3   4   5   6
1  7  8  9  10  11  12

In [7]:
df.stack()

     A   B
0 a  1   4
  b  2   5
  c  3   6
1 a  7  10
  b  8  11
  c  9  12

In [8]:
df.stack(level=0)

      a   b   c
0 A   1   2   3
  B   4   5   6
1 A   7   8   9
  B  10  11  12

## pivot/melt

In [9]:
df = pd.DataFrame(data={'A': ['one'] * 3 + ['two'] * 3,
                        'B': ['a', 'b', 'c'] * 2,
                        'C': np.arange(1, 7),
                        'D': np.arange(2, 13, 2)})
df

     A  B  C   D
0  one  a  1   2
1  one  b  2   4
2  one  c  3   6
3  two  a  4   8
4  two  b  5  10
5  two  c  6  12


`pivot()` 메서드의 parameter:

*   `index`: 원본 데이터 프레임을 pivotiong을 할 때, row index로 사용할 컬럼(들)의 이름(레이블)
*   `columns`: 원본 데이터 프레임을 pivoting을 할 때, column 이름(레이블)으로 사용할 컬럼(들)의 이름(레이블)
*   `values`: 원본 데이터 프레임을 pivoting을 할 때, 각 셀에 저장될 값으로 사용할 컬럼(들)의 이름(레이블)

In [10]:
pivoted1 = df.pivot(index='A',
                    columns='B',
                    values='C')
pivoted1

B    a  b  c
A
one  1  2  3
two  4  5  6

In [11]:
pivoted1.melt()

   B  value
0  a      1
1  a      4
2  b      2
3  b      5
4  c      3
5  c      6